chapter_11/runs/F1car/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          20;
wheelRadius     0.318;
wheelBase       2.786;
wheelSpeed      #calc "$Uinlet / $wheelRadius";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($Uinlet 0 0);
    }

    ground { $inlet; }

    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform ($Uinlet 0 0);
    }

    wall
    {
        type            noSlip;
    }

    processor
    {
        type            processor;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
